#--------------------------------
'''

'''
#--------------------------------
'''
sort epitheto k meta onoma k afm k imeromia{{{{{{{{{{{{{{{}}}}}}}}}}}}}}}
kai na krataw to repo {{{{{{{{{{{{{{}}}}}}}}}}}}}}
savatokuriako na einai gri kai h argies na einai allo xrwma{{{{{{{{{{{{{}}}}}}}}}}}}}
'''
#--------------------------------
'''
22:00-06:00 ΕΙΝΑΙ ΝΥΧΤΕΡΙΝΟ ΩΡΑΡΙΟ ΟΛΕς ΤΙς ΗΜΕΡΕΣ ΤΟΥ ΕΤΟΥΣ
00:00:01-23:59:59 ΚΥΡΙΑΚΗ Η ΑΡΓΙΑ

23:00 ΣΑΒΒΑΤΟ - 07:00 ΚΥΡΙΑΚΗ = 7 ΝΥΧΤΕΡΙΝΕΣ (25%) ΚΑΙ 7 ΚΥΡΙΑΚΗ/ΑΡΓΙΑ (75%)

ΠΟΣΕΣ ΩΡΕΣ ΕΡΓΑΣΙΑΣ ΕΙΝΑΙ ΣΤΟ ΠΡΟΓΡΑΜΜΑ - ΠΟΣΕΣ ΝΥΧΤΑ - ΠΟΣΕΣ ΑΡΓΙΑ 
'''
#--------------------------------
'''
Public Class frmΑργίες

    Private Sub frmΑργίες_Load(ByVal sender As System.Object, ByVal e As System.EventArgs) Handles MyBase.Load
        
        Label1.Text = ΑργίεςΈτους(0) & " Πρωτοχρονιά"
        Label2.Text = ΑργίεςΈτους(1) & " Θεοφάνια"
        Label3.Text = ΑργίεςΈτους(2) & " Εθνική εορτή 25η Μαρτίου"
        Label4.Text = ΑργίεςΈτους(3) & " Πρωτομαγιά"
        Label5.Text = ΑργίεςΈτους(4) & " Κοίμηση της Θεοτόκου"
        Label6.Text = ΑργίεςΈτους(5) & " Εθνική εορτή 28η Οκτωβρίου"
        Label7.Text = ΑργίεςΈτους(6) & " Χριστούγεννα"
        Label8.Text = ΑργίεςΈτους(7) & " Δεύτερη μέρα Χριστουγέννων"
        Label9.Text = ΑργίεςΈτους(8) & " Καθαρά Δευτέρα"
        Label10.Text = ΑργίεςΈτους(9) & " Μεγάλη Παρασκευή"
        Label11.Text = ΑργίεςΈτους(10) & " Πάσχα"
        Label12.Text = ΑργίεςΈτους(11) & " Δεύτερη μέρα Πάσχα"

    End Sub


End Class


 Public Function συνΕύρεσηΠάσχα(ByVal dateΗμερομηνία As Date) As Object


     'Υπλογισμός Πάσχα και κινητών Εορτών/////////////////////////////////
     Dim intΕτος As Integer = dateΗμερομηνία.Year
     Dim dblΕπακτή As Double
     Dim dblΗμέραΠάσχα As Double
     Dim inthlΕτος As Integer
     Dim intΥπόλοιπο As Integer
     Dim dateΗμερομηνιαΠάσχα As Date
     Dim dateΠρώτηΜάρτη As New Date(intΕτος, 3, 1)

     'Από τον αριθμό του έτους για το οποίο γίνεται ο προσδιορισμός αφαιρούμε τον αριθμό 2
     inthlΕτος = intΕτος - 2

     'Το υπόλοιπο το διαιρούμε με τον αριθμό 19 
     intΥπόλοιπο = inthlΕτος Mod 19

     'Το υπόλοιπο της διαίρεσης το πολλαπλασιάζουμε με τον αριθμό 11 
     intΥπόλοιπο *= 11

     'Το γινόμενο του πολλαπλασιασμού το διαιρούμε με τον αριθμό 30.
     'Το υπόλοιπο της διαίρεσης λέγεται επακτή και συμβολίζεται με το γράμμα ''Ε'' 
     dblΕπακτή = intΥπόλοιπο Mod 30

     'Τέλος αφαιρούμε την Επακτή= ''Ε'' από τον αριθμό 44 
     dblΗμέραΠάσχα = 44 - dblΕπακτή

     'Αν(το) ''Ε'' είναι μεγαλύτερο από 23, το υπόλοιπο της αφαίρεσης ''44-Ε'' 
     'μας δίνει την ημερομηνία της Πασχαλινής Πανσελήνου το μήνα Απρίλιο του Ιουλιανού Ημερολογίου.
     'Εάν(το) ''Ε'' είναι μικρότερο ή ίσο με το 23, τότε το υπόλοιπο της αφαίρεσης ''44-Ε'' 
     'μας δίνει την ημερομηνία της Πασχαλινής Πανσελήνου το μήνα Μάρτιο του Ιουλιανού Ημερολογίου. 

     If dblΕπακτή > 23 Then
         dateΗμερομηνιαΠάσχα = New Date(intΕτος, 4, CInt(Int(dblΗμέραΠάσχα)))
     Else
         dateΗμερομηνιαΠάσχα = DateAdd(DateInterval.Day, dblΗμέραΠάσχα - 1, dateΠρώτηΜάρτη)
     End If
     'Στην ημερομηνία που βρήκαμε στο if α ή στο if β προσθέτουμε 13 ημέρες και βρίσκουμε την ημέρα
     ' της Πασχαλινής Πανσελήνου στο Γρηγοριανό ημερολόγιο που χρησιμοποιούμε σήμερα.

     dateΗμερομηνιαΠάσχα = dateΗμερομηνιαΠάσχα.AddDays(13)

     'Την αμέσως επόμενη Κυριακή της ημερομηνίας που βρίσκουμε γιορτάζεται το Ελληνικό Ορθόδοξο Πάσχα. 

     dateΗμερομηνιαΠάσχα = dateΗμερομηνιαΠάσχα.AddDays(1)

     'Do Until dateΗμερομηνιαΠάσχα.DayOfWeek = DayOfWeek.Sunday
     'dateΗμερομηνιαΠάσχα = dateΗμερομηνιαΠάσχα.AddDays(1)
     'Loop

     dateΗμερομηνιαΠάσχα = dateΗμερομηνιαΠάσχα.AddDays((DayOfWeek.Sunday - dateΗμερομηνιαΠάσχα.DayOfWeek + 7) Mod 7)

     ΑργίεςΈτους(0) = New Date(dateΗμερομηνία.Year, 1, 1)
     ΑργίεςΈτους(1) = New Date(dateΗμερομηνία.Year, 1, 6)
     ΑργίεςΈτους(2) = New Date(dateΗμερομηνία.Year, 3, 25)
     ΑργίεςΈτους(3) = New Date(dateΗμερομηνία.Year, 5, 1)
     ΑργίεςΈτους(4) = New Date(dateΗμερομηνία.Year, 8, 15)
     ΑργίεςΈτους(5) = New Date(dateΗμερομηνία.Year, 10, 28)
     ΑργίεςΈτους(6) = New Date(dateΗμερομηνία.Year, 12, 25)
     ΑργίεςΈτους(7) = New Date(dateΗμερομηνία.Year, 12, 26)
     ΑργίεςΈτους(8) = New Date(dateΗμερομηνία.Year, dateΗμερομηνιαΠάσχα.AddDays(-48).Month, dateΗμερομηνιαΠάσχα.AddDays(-48).Day)
     ΑργίεςΈτους(9) = New Date(dateΗμερομηνία.Year, dateΗμερομηνιαΠάσχα.AddDays(-2).Month, dateΗμερομηνιαΠάσχα.AddDays(-2).Day)
     ΑργίεςΈτους(10) = New Date(dateΗμερομηνία.Year, dateΗμερομηνιαΠάσχα.Month, dateΗμερομηνιαΠάσχα.Day)
     ΑργίεςΈτους(11) = New Date(dateΗμερομηνία.Year, dateΗμερομηνιαΠάσχα.AddDays(1).Month, dateΗμερομηνιαΠάσχα.AddDays(1).Day)

     Return dateΗμερομηνιαΠάσχα

 End Function
'''